{"pages":[{"title":"About","date":"2024-04-15T07:00:05.974Z","path":"about/index.html","text":""},{"title":"Categories","date":"2024-04-15T07:00:05.974Z","path":"categories/index.html","text":""}],"posts":[{"title":"VueJS #1 Fundamental Topics","date":"2024-04-15T09:38:54.000Z","path":"wiki/Programming/VueJS/1-fundamental-topics/","text":"Vue is a JavaScript framework for building user interfaces. It builds on top of standard HTML, CSS and JavaScript, and provides a declarative and component-based programming model that helps you efficiently develop user interfaces, be it simple or complex. What is Vue?Vue is a JavaScript framework for building interfaces. It buids on top of 3 standards: HTML CSS JavaScript and provides a declarative, component-based programming model that helps you efficiently develop user interfaces of any complexity. Here is a minimal example: 1234567891011// Options API import { createApp } from &#39;vue&#39; createApp({ data() { return { count: 0 } } }).mount(&#39;#app&#39;) 12345&lt;div id=&quot;app&quot;&gt; &lt;button @click=&quot;count++&quot;&gt; Count is: {{ count }} &lt;/button&gt; &lt;/div&gt; The above example demonstrates the two core features of Vue: Declarative Rendering: extends standard HTML with a template syntax that allows us to declaratively describe HTML output based on JavaScript state. Reactivity: automatically tracks JavaScript state changes and efficiently updates the DOM when changes happen. Prerequisites The rest of the documentation assumes basic familiarity with HTML, CSS, and JavaScript. If you are totally new to frontend development, it might not be the best idea to jump right into a framework as your first step - grasp the basics and then come back! You can check your knowledge level with these overviews for JavaScript, HTML and CSS if needed. Prior experience with other frameworks helps, but is not required. The Progressive FrameworkVue is designed to be flexible and incrementally adoptable. Depending on your use case, Vue can be used in different ways: Enhancing static HTML without a build step Embedding as Web Components on any page Single-Page Application (SPA) Fullstack &#x2F; Server-Side Rendering (SSR) Jamstack &#x2F; Static Site Generation (SSG) Targeting desktop, mobile, WebGL, and even the terminal This is why we call Vue “The Progressive Framework”: it’s a framework that can grow with you and adapt to your needs. Single-File Components​In most build-tool-enabled Vue projects, we author Vue components using an HTML-like file format called Single-File Component (also known as *.vue files, abbreviated as SFC). A Vue SFC, as the name suggests, encapsulates the component’s logic (JavaScript), template (HTML), and styles (CSS) in a single file. Here’s the previous example, written in SFC format: 12345678910111213141516171819&lt;script&gt; export default { data() { return { count: 0 } } } &lt;/script&gt; &lt;template&gt; &lt;button @click=&quot;count++&quot;&gt;Count is: {{ count }}&lt;/button&gt; &lt;/template&gt; &lt;style scoped&gt; button { font-weight: bold; } &lt;/style&gt; API StylesVue components can be authored in two different API styles: Options API and Composition API. Options APIWith Options API, we define a component’s logic using an object of options such as data, methods, and mounted. Properties defined by options are exposed on this inside functions, which points to the component instance: 123456789101112131415161718192021222324252627282930&lt;script&gt; export default { // Properties returned from data() become reactive state // and will be exposed on `this`. data() { return { count: 0 } }, // Methods are functions that mutate state and trigger updates. // They can be bound as event handlers in templates. methods: { increment() { this.count++ } }, // Lifecycle hooks are called at different stages // of a component&#39;s lifecycle. // This function will be called when the component is mounted. mounted() { console.log(`The initial count is ${this.count}.`) } } &lt;/script&gt; &lt;template&gt; &lt;button @click=&quot;increment&quot;&gt;Count is: {{ count }}&lt;/button&gt; &lt;/template&gt; Composition APIWith Composition API, we define a component’s logic using imported API functions. In SFCs, Composition API is typically used with &lt;script setup&gt;. The setup attribute is a hint that makes Vue perform compile-time transforms that allow us to use Composition API with less boilerplate. For example, imports and top-level variables &#x2F; functions declared in &lt;script setup&gt; are directly usable in the template. Here is the same component, with the exact same template, but using Composition API and &lt;script setup&gt; instead: 1234567891011121314151617181920&lt;script setup&gt; import { ref, onMounted } from &#39;vue&#39; // reactive state const count = ref(0) // functions that mutate state and trigger updates function increment() { count.value++ } // lifecycle hooks onMounted(() =&gt; { console.log(`The initial count is ${count.value}.`) }) &lt;/script&gt; &lt;template&gt; &lt;button @click=&quot;increment&quot;&gt;Count is: {{ count }}&lt;/button&gt; &lt;/template&gt; Which to Choose?The Options API: is centered around the concept of a “component instance” (this as seen in the example), which typically aligns better with a class-based mental model for users coming from OOP language backgrounds. It is also more beginner-friendly by abstracting away the reactivity details and enforcing code organization via option groups. The Composition API: is centered around declaring reactive state variables directly in a function scope and composing state from multiple functions together to handle complexity. It is more free-form and requires an understanding of how reactivity works in Vue to be used effectively. In return, its flexibility enables more powerful patterns for organizing and reusing logic. Both API styles are fully capable of covering common use cases. They are different interfaces powered by the exact same underlying system. In fact, the Options API is implemented on top of the Composition API! The fundamental concepts and knowledge about Vue are shared across the two styles. If you are new to Vue, here’s our general recommendation: For learning purposes, go with the style that looks easier to understand to you. Again, most of the core concepts are shared between the two styles. You can always pick up the other style later. For production use: Go with Options API if you are not using build tools, or plan to use Vue primarily in low-complexity scenarios, e.g. progressive enhancement. Go with Composition API + Single-File Components if you plan to build full applications with Vue. You don’t have to commit to only one style during the learning phase. The rest of the documentation will provide code samples in both styles where applicable, and you can toggle between them at any time using the API Preference switches at the top of the left sidebar.","tags":[],"categories":[{"name":"Programming","slug":"Programming","permalink":"http://aritlh.github.io/categories/Programming/"},{"name":"VueJS","slug":"Programming/VueJS","permalink":"http://aritlh.github.io/categories/Programming/VueJS/"}]},{"title":"Badstore v1.2.3","date":"2019-02-11T21:14:54.000Z","path":"wiki/Hacking Walkthrough/Vulnhub/badstore-v123/","text":"The following is a vulnhub engine search from 2004. While this website may not be completely safe from advanced attacks, it serves as a valuable learning resource for beginners like me to practice identifying and exploiting common and easy-to-find web application vulnerabilities. Boot the machine, then perform host scanning using netdiscover. 1$ sudo netdiscover After obtaining the target IP, perform port scanning using nmap. 1$ sudo nmap -sSC -Pn &lt;IP&gt; nmap: Calls the Nmap program. -sS: Performs a TCP SYNC scan, which is a fast and efficient type of port scan. -C: Enables Nmap’s default script to get more information about the target. -Pn: Ignores host discovery and continues scanning on the given target, regardless of whether the target responds or not. &lt;IP&gt;: The IP address of the target to be scanned So, this command will perform a TCP SYN port scan on &lt;IP&gt; display the version of Nmap in use, enable Nmap default scripts to gather additional information about the target, and will continue the scan without verifying whether the target is responding or not. we also found MySQL service open, Let’s try to access the database using root user. 12345678910111213141516171819202122232425262728293031323334353637... PORT STATE SERVICE VERSION 80/tcp open http Apache httpd 1.3.28 ((Unix) mod_ssl/2.8.15 OpenSSL/0.9.7c) | http-robots.txt: 5 disallowed entries |_/cgi-bin /scanbot /backup /supplier /upload |_http-server-header: Apache/1.3.28 (Unix) mod_ssl/2.8.15 OpenSSL/0.9.7c |_http-title: Welcome to BadStore.net v1.2.3s | http-methods: |_ Potentially risky methods: TRACE 443/tcp open ssl/http Apache httpd 1.3.28 ((Unix) mod_ssl/2.8.15 OpenSSL/0.9.7c) | sslv2: | SSLv2 supported | ciphers: | SSL2_RC4_128_EXPORT40_WITH_MD5 | SSL2_RC4_64_WITH_MD5 | SSL2_DES_192_EDE3_CBC_WITH_MD5 | SSL2_RC2_128_CBC_WITH_MD5 | SSL2_IDEA_128_CBC_WITH_MD5 | SSL2_DES_64_CBC_WITH_MD5 | SSL2_RC4_128_WITH_MD5 |_ SSL2_RC2_128_CBC_EXPORT40_WITH_MD5 | ssl-cert: Subject: commonName=www.badstore.net/organizationName=BadStore.net/stateOrProvinceName=Illinois/countryName=US | Subject Alternative Name: email:root@badstore.net | Not valid before: 2006-05-10T12:52:53 |_Not valid after: 2009-02-02T12:52:53 |_http-server-header: Apache/1.3.28 (Unix) mod_ssl/2.8.15 OpenSSL/0.9.7c |_ssl-date: 2024-02-20T12:53:57+00:00; -1d01h58m15s from scanner time. |_http-title: Welcome to BadStore.net v1.2.3s | http-robots.txt: 5 disallowed entries |_/cgi-bin /scanbot /backup /supplier /upload | http-methods: |_ Potentially risky methods: TRACE 3306/tcp open mysql MySQL 4.1.7-standard | mysql-info: | Protocol: 10 | Version: 4.1.7-standard ... 1$ mysql -h &lt;IP&gt; -u root -p From this exposed Database we are able to obtain:","tags":[],"categories":[{"name":"Hacking Walkthrough","slug":"Hacking-Walkthrough","permalink":"http://aritlh.github.io/categories/Hacking-Walkthrough/"},{"name":"Vulnhub","slug":"Hacking-Walkthrough/Vulnhub","permalink":"http://aritlh.github.io/categories/Hacking-Walkthrough/Vulnhub/"}]},{"title":"Git commit message 基本规范","date":"2019-02-11T21:14:54.000Z","path":"wiki/Technology Development/Git/git-commit-message-basic-specifications/","text":"When using git to commit a version, the commit message is very important, as you need to be able to look back at the commit log and see what was changed each time. When we write this commit message, we should follow a certain structure to help us standardize and clarify our thinking. We generally follow the thoughtbot specification, and here are their instructions 5 Useful Tips For A Better Commit Message. 12345650-character subject line 72-character wrapped longer description. This should answer. * Why was this change necessary? * Why was this change necessary? * How does it address the problem? * How does it address the problem? * Are there any side effects? Include a link to the ticket, if any. Simply put: the first line should be no more than 50 characters. 2. the second line is a blank line the third line begins with a descriptive message, each line should be no more than 72 characters in length, with a serial number and no period at the end the descriptive information starting on the third line is the main description: What changes were made to this submission? What changes have been made to this submission? How is the problem being solved? How does it address the problem? Will it affect anything? After the descriptive message, either leave a blank line and close the issue or give a link to the appropriate ticket. Example: 12345678fix($compile): couple of unit tests for IE9 1. Older IEs serialize html uppercased, but IE9 does not... 2. would be better to expect case insensitive, unfortunately jasmine does 3. not allow to user regexps for throw expectations Closes #392 Breaks foo.bar api, foo.baz should be used instead","tags":[],"categories":[{"name":"Technology Development","slug":"Technology-Development","permalink":"http://aritlh.github.io/categories/Technology-Development/"},{"name":"Git","slug":"Technology-Development/Git","permalink":"http://aritlh.github.io/categories/Technology-Development/Git/"}]},{"title":"Welcome Aritlh's Wiki Site","date":"2017-01-22T21:14:54.000Z","path":"wiki/index/","text":"This is Aritlh’s personal Wiki site, mainly recording some scattered knowledge points summarized from his own words. I’ve always felt that knowledge should not be fragmented, but structured. So I hope to find an elegant way to manage my knowledge. I have learned about or tried methods such as OneNote, Evernote, Blogs, Wikis, etc. and summarized a set of processes for knowledge acquisition, absorption, and management that I think is relatively reasonable: Use web pages, RSS, WeChat, and other online channels as sources of knowledge acquisition. Use a note-taking system (handwritten notes, OneNote, Evernote) to initially filter valuable and targeted information, bookmark information, classify and organize it, and take notes on the key points after reading. For the occasional one or two sentences, or very scattered ideas, inspirations, and initially digested content that come to mind, record them in a Wiki. Finally, when there is a certain amount of content in a section of the Wiki, re-read the notes and content in that section of the Wiki, refine and distill them, add your own thoughts and understanding, and write an article to be published on a blog. In practice, the note-taking system is mainly for classifying and organizing large chunks of information, the Wiki is mainly for accumulating scattered knowledge, and the blog is only for the essence. When a section of the Wiki is first created, there may be very little content or just a sentence. But through this process, as you encounter more and more about that topic, the scattered knowledge also increases, and the content recorded in that section of the Wiki will also increase, which is to structure and organize what was originally a large amount of fragmented knowledge through accumulation. The purpose of the blog is to share and showcase your knowledge and demonstrate your level of expertise. It needs to present something substantial, so it is not suitable for scattered snippets of knowledge. It is more suitable for presenting a series of summaries or tutorials, as a highly systematic knowledge platform. When I tried to deploy my own Wiki system, I started to struggle with choosing which Wiki system to use. Referring to online blogs, I actually deployed and compared several popular Wiki systems: MediaWiki, DokuWiki, MDwiki, TiddlyWiki, wiz, vimwiki, Simiki, Wikitten, etc. None of them were satisfactory. Some were difficult and complex to deploy, some had ugly interfaces, some couldn’t have nested categories, some nested categories couldn’t be expanded, some couldn’t search, and some even didn’t use Markdown… Based on these unsatisfactory user experiences, I summarized some of my requirements for a personal Wiki: Simple and beautiful interface with a friendly font and layout Support for multi-level categorization Easy to modify and update content Simple deployment Category directories can be expanded and collapsed When a category is expanded, you can view the titles of all articles&#x2F;entries under that category Each article&#x2F;entry can be assigned multiple categories&#x2F;tags The Wiki should support internal linking Use Markdown to write articles&#x2F;entries Support full-text search (searchable content and titles) In my previous usage, Wikitten was the closest to my needs, but there were still some conditions that were not met, such as deployment and search. But personally, I liked the style of Wikitten. So in the end, I chose to mimic the style of Wikitten and write this Hexo-based Wiki theme hexo-theme-Wikitten as my own Wiki system, which basically implements the above requirements. Now I’m using it for myself for the time being, of course, this initial functionality is still very simple, and there is a bunch of bugs and TODO lists that need to be maintained. I welcome anyone interested to submit PRs.","tags":[],"categories":[]}],"categories":[{"name":"Programming","slug":"Programming","permalink":"http://aritlh.github.io/categories/Programming/"},{"name":"VueJS","slug":"Programming/VueJS","permalink":"http://aritlh.github.io/categories/Programming/VueJS/"},{"name":"Hacking Walkthrough","slug":"Hacking-Walkthrough","permalink":"http://aritlh.github.io/categories/Hacking-Walkthrough/"},{"name":"Vulnhub","slug":"Hacking-Walkthrough/Vulnhub","permalink":"http://aritlh.github.io/categories/Hacking-Walkthrough/Vulnhub/"},{"name":"Technology Development","slug":"Technology-Development","permalink":"http://aritlh.github.io/categories/Technology-Development/"},{"name":"Git","slug":"Technology-Development/Git","permalink":"http://aritlh.github.io/categories/Technology-Development/Git/"}],"tags":[]}